DeviceFileEvents
| where DeviceFileEvents.Timestamp > ago(24h)
| where DeviceFileEvents.ActionType == "FileCreated" or DeviceFileEvents.ActionType == "FileModified" 
| where DeviceFileEvents.FileName endswith ".encrypted" or DeviceFileEvents.FileName endswith ".locked" or DeviceFileEvents.FileName endswith ".crypted" 
  or DeviceFileEvents.FileName endswith ".crypt" or DeviceFileEvents.FileName endswith ".crypto" or DeviceFileEvents.FileName endswith ".enc" 
  or DeviceFileEvents.FileName endswith ".ransom" or DeviceFileEvents.FileName endswith ".WNCRY" or DeviceFileEvents.FileName endswith ".wcry" 
  or DeviceFileEvents.FileName endswith ".lock" or DeviceFileEvents.FileName endswith ".locky" or DeviceFileEvents.FileName endswith ".cerber" 
  or DeviceFileEvents.FileName endswith ".zepto" or DeviceFileEvents.FileName endswith ".thor" or DeviceFileEvents.FileName endswith ".aesir" 
  or DeviceFileEvents.FileName endswith ".sage" or DeviceFileEvents.FileName endswith ".petya"
  or DeviceFileEvents.FolderPath has "DECRYPT_INSTRUCTION" or DeviceFileEvents.FileName startswith "README.txt"
| summarize
    FileCount = count(),
    FileList = make_set(DeviceFileEvents.FileName, 100),
    FileExtensionList = make_set(tostring(extract(@"\.([A-Za-z0-9_-]{1,}$)", 1, DeviceFileEvents.FileName)), 100)
    by DeviceFileEvents.DeviceId, DeviceFileEvents.DeviceName, DeviceFileEvents.InitiatingProcessFileName, DeviceFileEvents.InitiatingProcessAccountName
| where FileCount > 5
| join (
    DeviceProcessEvents
    | where DeviceProcessEvents.Timestamp > ago(24h)
    | where DeviceProcessEvents.ProcessCommandLine has_any(
        "vssadmin delete shadows", "wmic shadowcopy delete", "bcdedit /set",
        "wbadmin delete catalog", "wevtutil cl", "cipher /w:", "fsutil usn delete",
        "icacls.exe \"/grant Everyone:F\"", "attrib.exe +H", "certutil.exe -decode", 
        "taskkill.exe /im", "bootcfg.exe /raw", "powershell.exe -ep bypass", 
        "vssadmin resize shadowstorage", "reg.exe add HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run"
    )
) on DeviceId
| project
    DeviceProcessEvents.Timestamp,
    DeviceFileEvents.DeviceName,
    DeviceFileEvents.ActionType,
    FileCount,
    FileList,
    FileExtensionList,
    DeviceFileEvents.InitiatingProcessFileName,
    DeviceProcessEvents.ProcessCommandLine,
    DeviceFileEvents.InitiatingProcessAccountName,
    ReportId=hash(strcat(DeviceFileEvents.DeviceName, DeviceFileEvents.InitiatingProcessFileName))
